In [1]:
import pandas as pd

In [7]:
df1 = pd.read_csv('dataset1.csv')

In [8]:
df1

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score(1-100)
0           1    Male   19                  15                     39
1           2    Male   21                  15                     81
2           3  Female   20                  16                      6
3           4  Female   23                  16                     77
4           5  Female   31                  17                     40
5           6  Female   22                  17                     76
6           7  Female   35                  18                      6
7           8  Female   23                  18                     94
8           9    Male   64                  19                      3
9          10  Female   30                  19                     72

In [9]:
df2 = pd.read_csv('dataset2.csv')

In [10]:
df2

   CustomerID      Area
0           1     Dhaka
1           2  Rajshahi
2           3   Rangpur
3           4    Khulna
4           5     Dhaka
5           6    Khulna
6           7     Dhaka
7           8   Rangpur
8           9   Rangpur
9          10     Dhaka

# Merging Two Dataset

In [22]:
df3 = pd.merge(df1,df2,on='CustomerID')

In [23]:
df3

,CustomerID,Gender,Age,Annual Income (k$),Spending Score(1-100),Area
0,1,Male,19,15,39,Dhaka
1,2,Male,21,15,81,Rajshahi
2,3,Female,20,16,6,Rangpur
3,4,Female,23,16,77,Khulna
4,5,Female,31,17,40,Dhaka
5,6,Female,22,17,76,Khulna
6,7,Female,35,18,6,Dhaka
7,8,Female,23,18,94,Rangpur
8,9,Male,64,19,3,Rangpur
9,10,Female,30,19,72,Dhaka